package day23Home;

public class Main {

	public static void main(String[] args) {
/*
 * 	가계부 관리하는 프로그램을 작성하세요
 * 			메뉴
 * 			1. 내역입력
 * 			2. 내역수정
 * 			3. 내역삭제
 * 			4. 내역조회
 * 			5. 종료
 * 			매뉴 선택 : 1
 * 			수입/지출 : 수입
 * 			날짜 : 2021-06-10
 * 			분류목록
 * 			월급
 * 			용돈
 * 			부수입
 * 			분류: 월급
 * 			금액: 3000000
 * 			내용: 6월 월급 
 * 			메뉴
 * 			1. 내역입력
 * 			2. 내역수정
 * 			3. 내역삭제
 * 			4. 내역조회
 * 			5. 종료
 * 			매뉴 선택 : 2
 * 			날짜: 2024-06-10
 * 			1. 2024-06-10| 수입|월급|3000000|6월입금
 * 			내역선택: 1	
 *			 날짜 : 2021-06-10
 * 			분류목록
 * 			월급
 * 			용돈
 * 			부수입
 * 			분류: 월급
 * 			금액: 2800000
 * 			내용: 6월 월급 
 * 			수정완료
 * 			메뉴
 * 			1. 내역입력
 * 			2. 내역수정
 * 			3. 내역삭제
 * 			4. 내역조회
 * 			5. 종료
 * 			매뉴 선택 : 3
 * 			날짜: 2024-06-10
 * 			1. 2024-06-10| 수입|월급|3000000|6월입금
 * 			내역선택: 1
 * 			내역이 삭제되었습니
 * 			메뉴
 * 			1. 내역입력
 * 			2. 내역수정
 * 			3. 내역삭제
 * 			4. 내역조회
 * 			5. 종료
 * 			매뉴 선택 : 4 //날짜순으로
 * 			날짜: 2024-06-10
 * 			1. 2024-06-10| 수입|월급|3000000|6월입금
 * 
 * 
 */
	}

}
