package account;

public class Main {

	public static void main(String[] args) {
//			 가계부를 관리하는 프로그램을 작성하세요
//		
//			 메뉴 
//			 1. 내역 입력		
//			 2. 수정 
//			 3. 삭제
//			 4. 조회
//			 5. 종료
//		메뉴선택: 1 
//		수입/지출: 수입 입력하면 
//		날짜: 2021-06-10
//		분류 목록
//		월급
//		용돈
//		부수입
//		분류: 월급
//		금액: 3000000
//		내용: 6월 월급 
//		매뉴선택: 2
//		날짜: 2024-06-10
//		1. 2024-06-10 수입 | 월급 | 3000000 | 6월 월급
//		내역선택: 1
//		날짜: 2021-06-10
//		분류 목록
//		월급
//		용돈
//		부수입
//		분류: 월급
//		금액: 3000000
//		내용: 6월 월급 
//		 메뉴 
//		 1. 내역 입력		
//		 2. 수정 
//		 3. 삭제
//		 4. 조회
//		 5. 종료
//	메뉴선택: 3
//		날짜: 2024-06-10
//		1. 2024-06-10 수입 | 월급 | 3000000 | 6월 월급
//		내역선택: 1
//		내역이 삭제되었습니다
//		 메뉴 
//		 1. 내역 입력		
//		 2. 수정 
//		 3. 삭제
//		 4. 조회
//		 5. 종료
//			메뉴선택: 4
//		1. 2024-06-10 수입 | 월급 | 3000000 | 6월 월급
		
		
		
		
		
		
		
		
		
		
	}

}
